test/request-response-samples/Dummy__should_add_prefix_for_unqualified_global_elements/request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.Dummy.com" xmlns:n="http://www.Dummy.com/Name/Types"><SOAP-ENV:Body><n:DummyRequest xmlns:n="http://www.Dummy.com/Name/Types"><DummyField1 language="en-US">Humpty</DummyField1><DummyFilter><DummyFilterString xmlns:c="http://www.Dummy.com/Common/Types">Dumpty</DummyFilterString></DummyFilter></n:DummyRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>